In [25]:
import pandas as pd
import numpy as np

In [26]:
#Define the Dataframe 
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

# Question 1

Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put inplace. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [27]:
for i in range(1, df['FlightNumber'].count() + 1):
      if pd.isnull(df.loc[i,'FlightNumber']):
            df.loc[i, 'FlightNumber'] = df.loc[i-1, 'FlightNumber'] + 10
print(df['FlightNumber'].astype(int))

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

# Question 2

The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [28]:
# temp data frame with split value columns 
temp = df["From_To"].str.split("_", n = 1, expand = True) 
  
# making separate Source column from temp data frame 
df["Source"]= temp[0] 
  
# making separate Destination column from temp data frame 
df["Destination"]= temp[1] 
print(df[['Source', 'Destination']])

     Source Destination
0    LoNDon       paris
1    MAdrid       miLAN
2    londON   StockhOlm
3  Budapest       PaRis
4  Brussels      londOn

# Question 3

Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [29]:
def convert(n):
    return n.title()

df['Source']=pd.DataFrame(map(convert,df['Source']))
df['Destination']=pd.DataFrame(map(convert,df['Destination']))
print("\nSource in Uppercase\n")
print(df['Source'])
print('-'*45)
print("\nDestination in Uppercase\n")
print(df['Destination'])

Source in Uppercase

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: Source, dtype: object
---------------------------------------------

Destination in Uppercase

0        Paris
1        Milan
2    Stockholm
3        Paris
4       London
Name: Destination, dtype: object

# Question 4

Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [30]:
df.drop(columns =["From_To"], inplace = True)
df.head()

   FlightNumber  RecentDelays              Airline    Source Destination
0       10045.0      [23, 47]               KLM(!)    London       Paris
1       10055.0            []    <Air France> (12)    Madrid       Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London   Stockholm
3       10075.0          [13]       12. Air France  Budapest       Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels      London

# Question 5

In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [31]:
print(df['RecentDelays'])
delays= pd.DataFrame(df.RecentDelays.tolist(), )
delays

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [38]:
#dropping the Recent delays columns
df = df.drop('RecentDelays',axis=1)
df

   FlightNumber              Airline    Source Destination
0       10045.0               KLM(!)    London       Paris
1       10055.0    <Air France> (12)    Madrid       Milan
2       10065.0  (British Airways. )    London   Stockholm
3       10075.0       12. Air France  Budapest       Paris
4       10085.0          "Swiss Air"  Brussels      London

In [39]:
#Concatenating and Renaming the two dataframes
data = pd.concat([df, delays], axis=1)
data.rename(columns = {0:'delay 1', 1:'delay 2', 2:'delay 3'}, inplace = True)
data

,FlightNumber,Airline,Source,Destination,delay 1,delay 2,delay 3
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN